# Imports

In [2]:
# Libraries
import pandas as pd
import numpy as np
import os

In [3]:
# Files
path = os.path.expanduser('~/Desktop/CareerFoundry/2.4/4.10.') # path to the root folder

### Products
df_products = pd.read_csv(
    os.path.join('~/Desktop/CareerFoundry/Data/products.csv'),
    index_col=False
)
### Orders
df_orders = pd.read_csv(os.path.join(path, '02 Data','Original Data', 'orders.csv')) 
### Customers
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))
### Departments
df_departments = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'))
### Orders Prior
df_orders_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'))

## Cleaning products.csv

In [4]:
### Products
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int64
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  int64
 3   department_id  49693 non-null  int64
 4   prices         49693 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

In [68]:
df_products.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,6b86b273ff34fce19d6b804eff5a3f5747ada4eaa22f1d...,prior,1,2,8,NaN
1,1,2398795,6b86b273ff34fce19d6b804eff5a3f5747ada4eaa22f1d...,prior,2,3,7,15.0
2,2,473747,6b86b273ff34fce19d6b804eff5a3f5747ada4eaa22f1d...,prior,3,3,12,21.0
3,3,2254736,6b86b273ff34fce19d6b804eff5a3f5747ada4eaa22f1d...,prior,4,4,7,29.0
4,4,431534,6b86b273ff34fce19d6b804eff5a3f5747ada4eaa22f1d...,prior,5,4,15,28.0

### 3. Datatype Consistency

In [64]:
df_products = df_products.astype({'product_id':'str', 'aisle_id':'category', 'department_id':'category'})

KeyError: "Only a column name can be used for the key in a dtype mappings argument. 'product_id' not found in columns."

### 4. Duplicates

In [14]:
print(df_products.duplicated().sum())

5

In [15]:
df_products = df_products.drop_duplicates()

### 5. Nulls

In [16]:
df_products.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [17]:
df_products = df_products[df_products['product_name'].isnull() == False]

## Cleaning orders.csv

In [18]:
df_orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

### 1. Droping Unnecessary Columns

In [19]:
### Orders
df_orders = df_orders.drop(columns=['eval_set'])

### 2. Renaming Columns

In [20]:
df_orders.rename(columns = {'order_dow':'order_day_of_week'}, inplace=True)

### 3. Datatype Consistency

In [21]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   order_day_of_week       int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(5)
memory usage: 156.6 MB

In [22]:
df_orders = df_orders.astype({'order_id':'str', 'user_id':'str'})

### 4. Duplicates

In [23]:
print(df_orders.duplicated().sum()) # no duplicates found

0

### 5. Nulls

In [24]:
df_orders.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [25]:
df_orders = df_orders.fillna(0) # Nulls probably mean that the customer made the first order, so they are replaced with '0'

## Cleaning customers.csv

In [26]:
df_customers.head()

,Unnamed: 0,user_id,Gender,STATE,date_joined,n_dependants,fam_status,age_group,income_bracket
0,0,4581c0113a43f51e6936887a17a5f3aa15b8d5620971dc...,Female,Missouri,01/2017,3,married,46-55,High
1,1,5c9ce36c302d7ae7788da06067c14bcfefdf448119347e...,Female,New Mexico,01/2017,0,single,36-45,Low
2,2,0e8046bde3a8be6ac0475aa85bd492313f971bf9954e66...,Male,Idaho,01/2017,2,married,26-35,Mid-high
3,3,89c3d9ccf6ea26abb0e8a1a65ca8c3e61127864bfd494d...,Female,Iowa,01/2017,0,single,36-45,Low
4,4,6335638549bc219c93c6b99bcb3939ad1d8f62d7dec732...,Female,Maryland,01/2017,1,married,26-35,Low

### 2. Renaming Columns

In [27]:
df_customers.rename(columns = { 'Gender':'gender', 'STATE':'state', 'n_dependants':'dependants',
                               'fam_status':'family_status', 
                    'income':'yearly_income'}, inplace=True)

### 3. Datatype Consistency

In [28]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Unnamed: 0      206209 non-null  int64
 1   user_id         206209 non-null  object
 2   gender          206209 non-null  object
 3   state           206209 non-null  object
 4   date_joined     206209 non-null  object
 5   dependants      206209 non-null  int64
 6   family_status   206209 non-null  object
 7   age_group       206209 non-null  object
 8   income_bracket  206209 non-null  object
dtypes: int64(2), object(7)
memory usage: 14.2+ MB

In [29]:
df_customers=df_customers.astype({'user_id':'str', 'gender':'category', 'state':'category', 'date_joined':'datetime64[ns]', 'family_status':'category'})

### 4. Duplicates

In [30]:
print(df_customers.duplicated().sum()) # no duplicates

0

### 5. Nulls

In [31]:
df_customers.isnull().sum() # there is no need to remove recors with NULLs as first name is not important for the analysis

Unnamed: 0        0
user_id           0
gender            0
state             0
date_joined       0
dependants        0
family_status     0
age_group         0
income_bracket    0
dtype: int64

## Cleaning departments.csv

In [32]:
df_departments.head() # Data is in the wide format.

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

### 0. Transposing data

In [33]:
df_departments = df_departments.T

In [34]:
df_departments.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [35]:
new_header = df_departments.iloc[0]

In [36]:
df_departments = df_departments[1:]

In [37]:
df_departments.columns = new_header

In [38]:
df_departments.head()

department_id department
1                 frozen
2                  other
3                 bakery
4                produce
5                alcohol

### 4. Duplicates

In [39]:
print(df_departments.duplicated().sum())

0

## Cleaning orders_products_prior.csv

In [40]:
df_orders_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

### 3. Datatype Consistency

In [41]:
df_orders_prior.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           int64
 1   product_id         int64
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(4)
memory usage: 989.8 MB

In [42]:
df_orders_prior = df_orders_prior.astype({'order_id':'str', 'product_id':'str'})

### 4. Duplicates

In [43]:
print(df_orders_prior.duplicated().sum()) # no duplicates found

0

### 5. Nulls

In [44]:
df_orders_prior.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

# Exports

Products

In [45]:
df_products.to_csv(os.path.join(path, '02 Data','Clean Data', 'products.csv'))

In [46]:
df_products.to_pickle(os.path.join(path, '02 Data','Clean Data', 'products.pkl'))

Orders

In [47]:
df_orders.to_csv(os.path.join(path, '02 Data','Clean Data', 'orders.csv'))

In [48]:
df_orders.to_pickle(os.path.join(path, '02 Data','Clean Data', 'orders.pkl'))

Customers

In [49]:
df_customers.to_csv(os.path.join(path, '02 Data','Clean Data', 'customers.csv'))

In [50]:
df_customers.to_pickle(os.path.join(path, '02 Data','Clean Data', 'customers.pkl'))

Departments

In [51]:
df_departments.to_csv(os.path.join(path, '02 Data','Clean Data', 'departments.csv'))

In [52]:
df_departments.to_pickle(os.path.join(path, '02 Data','Clean Data', 'departments.pkl'))

Prior Orders

In [53]:
df_orders_prior.to_csv(os.path.join(path, '02 Data','Clean Data', 'orders_products_prior.csv'))

In [54]:
df_orders_prior.to_pickle(os.path.join(path, '02 Data','Clean Data', 'orders_products_prior.pkl'))